W8D1/Reddit_rails/Reddit_Rails/app/controllers/users_controller.rb

  def update
    @user = User.find_by(id: params[:id])
    if @user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "username" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["username", "victoria"], ["updated_at", "2020-02-03 19:12:38.718775"], ["id", 1]]