W6D4/first-routes-and-controllers/app/controllers/artwork_shares_controller.rb

DELETE FROM "artwork_shares" WHERE "artwork_shares"."id" = $1  [["id", 17]]
---
    def destroy
        render json: ArtworkShare.destroy(params[:id])