W6D4/first-routes-and-controllers/app/controllers/users_controller.rb

    def show
        # :id = 2
        render json: User.find(params[:id]) #for hardcoding...User.find(2)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def update
        render json: User.find(params[:id]).update!(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "users" SET "email" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["email", "woodstock@gmail.com"], ["updated_at", "2020-01-23 18:55:28.888214"], ["id", 2]]

    def destroy
        render json: User.destroy(params[:id])
---
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 9]]