W6D5/cats_99/app/controllers/cats_controller.rb

  def show
    @kitty = Cat.find_by(id: params[:id])
---
SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

  def create
    kitty = Cat.new(cat_params)

    if kitty.save!
---
INSERT INTO "cats" ("birth_date", "color", "name", "sex", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["birth_date", "2020-01-15"], ["color", "orange"], ["name", "J"], ["sex", "M"], ["description", "Test"], ["created_at", "2020-01-25 00:52:23.119822"], ["updated_at", "2020-01-25 00:52:23.119822"]]

  def edit
    @kitty = Cat.find(params[:id])
---
SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]